#include <iostream>



using namespace std;

int main() {
	setlocale(0, "ukr");
	float b, q, s;         // b - перший член нескінченної прогресії; q - знаменник прогресії; s - сума прогресії
	cout << "Введіть перший член прогресії: ";
	cin >> b;
	if (b != 0) {
		cout << "Введіть знаменник прогресії: ";
		cin >> q;
		if (q > -1 && q != 0 && q < 1) {
			s = b / (1 - q);
			cout << "Сума прогресії: " << s << endl;  // знайдення суми прогресії і її виведення
		}
		else cout << "Error. Знаменник не може дорівнювати нулю або прогресія не є спадною\n";
	}
	else cout << "Error. Недопустиме значення першого члена.\n";
	system("pause");
	return 0;


}